Revit 2023 API
FabricRoundingManager.TotalLengthRoundingMethod Property
 Identifies the total length rounding method
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2016
Syntax
C#
public RoundingMethod TotalLengthRoundingMethod { get; set; }
Visual Basic
Public Property TotalLengthRoundingMethod As RoundingMethod
	Get
	Set
Visual C++
public:
property RoundingMethod TotalLengthRoundingMethod {
	RoundingMethod get ();
	void set (RoundingMethod value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: IsActiveOnElement property is false.
See Also
FabricRoundingManager Class
Autodesk.Revit.DB.Structure Namespace